## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.assemblyline_rescan_every_24_hours will be created
  + resource "aws_cloudwatch_event_rule" "assemblyline_rescan_every_24_hours" {
      + arn                 = (known after apply)
      + description         = "Fires every 24 hours"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "retry-stale-scans-production"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 0 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.trigger_api_lambda_to_rescan will be created
  + resource "aws_cloudwatch_event_target" "trigger_api_lambda_to_rescan" {
      + arn            = "arn:aws:lambda:ca-central-1:806545929748:function:api"
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + task = "assemblyline_resubmit_stale"
            }
        )
      + rule           = "retry-stale-scans-production"
      + target_id      = "scan-files-production-assemblyline-stale-scan-resubmitter"
    }

  # aws_lambda_permission.allow_cloudwatch_to_call_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "api"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.assemblyline_rescan_every_24_hours"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
